-- Данные для тестов! Взяты из головы (придуманны). Любое совпадение в реальными случайно!

USE `noginsk_school_bd`;

-- Модули(Программа обучения)  Имя модуля
INSERT IGNORE INTO `modules`(`modules_name`)
VALUES 
    ('Вводный(младший, средний)'),
    ('scrath'),
    ('Python'),
    ('HTML&CSS'),
    ('Photoshop'),
    ('Основы этики');

-- Клиенты вкл.потенциальных      Имя                 Отчество           Фамилия             Email         Телефон
INSERT IGNORE INTO `client`(`client_firstname`, `client_middlename`, `client_lastname`, `client_email`, `client_phone`)
VALUES 
    ('Иван', 'Федорович', 'Скоробогатько', 'skorobogatko77@yandex.ru', 9998775217),
    ('Ксенья', 'Альбертовна', 'Шипова', 'shipova.ksusha@mail.ru', 9285667798),
    ('Альдруида', 'Альбертовна', 'Штольцман', 'shtolcman1977@gmail.com', 9117654432),
    ('Арсений', 'Яковлевич', 'Горнин', 'senya-yak@gmail.com', 9257777755),
    ('Александр', 'Федорович', 'Майский', NULL, 9778906121),
    ('Мария', 'Ивановна', 'Любова', 'lubova-masha89@yandex.ru', 9156315145),
    ('Наталья', 'Игоревна', 'Римская', 'rim.natasha7701@mail.ru', 9667625546),
    ('Федор', 'Михайлович', 'Достаевкий', NULL, 9778905521),
    ('Максим', 'Петрович', 'Головин', 'golovin.maxim69@gmail.com', 9277665678),
    ('Борис', 'Николаевич', 'Доров', NULL, 9511516689),
    ('Юлия', 'Матвеевна', 'Никольская', 'nikolskaya.yulya@mail.ru', 9211111177),
    ('Татьяна', 'Михайлона', 'Большова', NULL, 9011014451),
    ('Мария', 'Федоровна', 'Добрая', 'dobraya1988@gmail.com', 9025020200);

-- Договора                       Id клиента             Сумма       Срок действия(ГГГГ-ММ-ДД)
INSERT IGNORE INTO `contract`(`contract_client_id`, `contract_sum`, `contract_time`)
VALUES 
    (1, 4700, '2022-02-27'),
    (1, 4700 , '2022-02-27'),
    (2, 22000, '2022-10-30'),
    (3, 12700, '2022-03-29'),
    (3, 12700, '2022-03-29'),
    (5, 70000, '2023-01-30'),
    (6, 10000, '2022-03-25'),
    (8, 72000, '2023-02-01'),
    (9, 65132, '2022-12-30'),
    (9, 65132, '2022-12-30'),
    (10, 4700, '2022-02-27'),
    (11, 4700, '2022-02-27'),
    (12, 12000 , '2022-04-01'),
    (13, 11100, '2022-03-30');

-- Работники                   Должность            Имя                 Отчество             Фамилия             Email           Телефон
INSERT IGNORE INTO `workers`(`workers_post`, `workers_firstname`, `workers_middlename`, `workers_lastname`, `workers_email`, `workers_phone`)
VALUES 
    ('Администратор', 'Наталья', 'Борисовна', 'Фролова', 'frolova.nataliya@yandex.ru', 9118766543),
    ('Тьютор', 'Елена', 'Алексеевна', 'Горлова', 'gorlova-elena91@gmail.com', 9667654253),
    ('Тьютор', 'Андрей', 'Андреевич', 'Путов', 'putov.andrey89@gmail.com', 9144445323),
    ('Ассистент', 'Петр', 'Петрович', 'Петров', 'petrov-petr1990@mail.ru', 9155556632),
    ('Ассистент', 'Ирина', 'Ивановна', 'Иванова', 'ivanova-irina9004@mail.ru', 9112778990);

-- Резиденты(Дети)                    Имя                  Отчество             Фамилия         Id Клиента(Родителя)
INSERT IGNORE INTO `resident`(`resident_firstname`, `resident_middlename`, `resident_lastname`, `resident_client_id`)
VALUES 
    ('Александр', 'Иванович', 'Скоробогатько', 1),
    ('Елизавета', 'Ивановна', 'Скоробогатько', 1),
    ('Антон', 'Гербертович', 'Шипов', 2),
    ('Марк', 'Андреевич', 'Штольцман', 3),
    ('Григорий', 'Андреевич', 'Штольцман', 3),
    ('Станислав', 'Александрович', 'Майский', 5),
    ('Мария', 'Григорьевна', 'Любова', 6),
    ('Александр', 'Федорович', 'Достаевский', 8),
    ('Петр', 'Максимович', 'Головин', 9),
    ('Елисей', 'Максимович', 'Головин', 9),
    ('Анна', 'Борисовна', 'Дорова', 10),
    ('Николай', 'Владимирович', 'Никольский', 11),
    ('Алексей', 'Михайлович', 'Большов', 12),
    ('Игорь', 'Станиславович', 'Добрый', 13);

-- Группы               Возрастная группа   Id Работника(кто ведет)
INSERT IGNORE INTO `groups`(`groups_age`, `groups_worker_id`)
VALUES 
    ('младшая', 3),
    ('средняя', 2);

-- (Дети в группах)                             Id Ребенка                        Id группы
INSERT IGNORE INTO `groups_residents`(`groups_residents_id_on_resident`, `groups_residents_id_on_groups`)
VALUES 
    (1, 1),
    (2, 2),
    (3, 2),
    (4, 1),
    (5, 1),
    (6, 2),
    (7, 1),
    (8, 2),
    (9, 1),
    (10, 1),
    (11, 2),
    (12, 1),
    (13, 2),
    (14, 2);

-- Табель                      Дата(ГГГГ-ММ-ДД)       Id Работника              часы
INSERT IGNORE INTO `work_list`(`work_list_date`, `work_list_workers_id`, `work_list_hour`)
VALUES 
    ('2021-10-10', 1 , 1),
    ('2021-10-10', 2, 1),
    ('2021-10-10', 4, 1),
    ('2021-10-19', 1, 3),
    ('2021-10-19', 2, 3),
    ('2021-10-19', 4, 3),
    ('2021-10-20', 1, 3),
    ('2021-10-20', 3, 3),
    ('2021-10-20', 5, 3),
    ('2021-10-28', 1, 3),
    ('2021-10-28', 2, 3),
    ('2021-10-28', 4, 3),
    ('2021-10-29', 1, 3),
    ('2021-10-29', 3, 3),
    ('2021-10-29', 5, 3),
    ('2021-11-05', 1, 4),
    ('2021-11-05', 2, 4),
    ('2021-11-05', 4, 4),
    ('2021-11-06', 1, 3),
    ('2021-11-06', 3, 3),
    ('2021-11-06', 5, 3),
    ('2021-11-10', 1, 2),
    ('2021-11-10', 2, 2),
    ('2021-11-10', 3, 2),
    ('2021-11-10', 4, 2);

-- Занятие                        Дата            Id группы           Id модуля
INSERT IGNORE INTO `lessons`(`lessons_date`, `lessons_group_id`, `lessons_module_id`)
VALUES 
    ('2021-10-19', 1, 1),
    ('2021-10-20', 2, 2),
    ('2021-10-28', 1, 1),
    ('2021-10-29', 2, 2),
    ('2021-11-05', 1, 1),
    ('2021-11-06', 2, 2);
    

-- Валюта                         id Ребенка      
INSERT IGNORE INTO `valute`(`valute_resident_id`)
VALUES 
    (1), (2), (3), (4), (5), (6), (7), (8), (9), (10), (11), (12), (13), (14);


-- Журнал занятия(Посещаемость)           Id Ребенка                   Id Занятия 
INSERT IGNORE INTO `class_journal`(`class_journal_resident_id`, `class_journal_lesson_id`)
VALUES 
    (1, 1),
    (4, 1),
    (5, 1),
    (7, 1),
    (9 , 1),
    (10, 1),
    (12, 1),
    (2, 2),
    (3, 2),
    (6, 2),
    (8, 2),
    (11, 2),
    (13, 2),
    (14, 2),
    (1, 3),
    (4, 3),
    (5, 3),
    (7, 3),
    (9, 3),
    (10, 3),
    (12, 3),
    (2, 4),
    (3, 4),
    (6, 4),
    (8, 4),
    (11, 4),
    (13, 4),
    (14, 4),
    (4, 5),
    (5, 5),
    (7, 5),
    (9, 5),
    (10, 5),
    (12, 5),
    (3, 6),
    (6, 6),
    (8, 6),
    (11, 6),
    (13, 6);


-- Журнал отработки                          Дата                     Id ребенка                    Id модуля
INSERT IGNORE INTO `extracurricular`(`extracurricular_date`, `extracurricular_resident_id`, `extracurricular_module_id`)
VALUES 
    ('2021-11-10', 1,  1),
    ('2021-11-10', 2,  2),
    ('2021-11-10',  14,  2);


-- мерч(Товары для ярмарки)      имя                 цена
INSERT INTO `kiber_merch`(`kiber_merch_name`, `kiber_merch_price`)
VALUES 
    ('Фирм.маска', 10), ('Фирм.рюкзак', 100), ('Нагрудная самка', 100), ('Флешка Minecraft', 300), ('ps4', 3000),
    ('фирм.футболка', 150), ('Фирм.кепка', 100);



-- Copyright (C) 2022 Владислав Горякин
    
